books/college-books.org
#+title: College Books
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil

* 5th year

** Server-Side Development

** Digital Signal Processing

1. Analogue And Digital Signal Processing And Coding
   - P. M. Grant ...[et al.]
   - Chartwell-Bratt
   - 1989
   - /ISBN-10: 0862382068/
   - /ISBN-13: 978-0862382063/
2. Advanced Topics In Signal Processing
   - Jae S. Lim and Alan V. Oppenheim
   - Prentice-Hall
   - c1988
   - /ISBN-10: 0130129801/
   - /ISBN-13: 978-0130129802/
3. Digital Signal Processing : Principles, Algorithms, And Applications
   - John G. Proakis, Dimitris G. Manolakis
   - Macmillan
   - c1992
   - Notes Rev. ed. of: Introduction to digital signal processing. c1988
4. Digital Signal Processing
   - Richard A. Roberts, Clifford T. Mullis
   - Addison-Wesley
   - c1987
5. Schaum's Outline Of Theory And Problems Of Digital Signal Processing
   - Monson H. Hayes
   - McGraw Hill
   - 1999
6. Two-Dimensional Signal And Image Processing
   - Jae S. Lim
   - Prentice Hall
   - c1990
7. Digital Coding Of Waveforms : Principles And Applications To Speech And Video
   - N.S. Jayant, Peter Noll
   - Prentice-Hall
   - c1984
8. Digital Signal Processing : Theory, Applications, And Hardware
   - Richard A. Haddad and Thomas W. Parsons
   - Computer Science Press
   - c1991
9. Fundamentals Of Digital Image Processing
   - Anil K. Jain
   - Prentice Hall
   - c1989
10. Digital Processing Of Speech Signals
    - Lawrence R. Rabiner, Ronald W. Schafer
    - Prentice-Hall
    - c1978
11. Speech And Audio Signal Processing : Processing And Perception Of Speech And Music
    - Ben Gold, Nelson Morgan
    - John Wiley
    - 2000

** Data Networks
- Computer Networks
  - 4th Edition
  - Andrew Tanenbaum
  - Pearson Education, 2003.
  - ISBN 0-13-038488-7
- Data Communications and Networking
  - 2nd ed.
  - Behrouz Forouzan
  - McGraw Hill, 2000.
  - ISBN 0-07-118160-1
- Data Communications, Computer Networks and Open Systems
  - 4th Edition
  - Fred Halsall
  - Addison-Wesley, 1995.
  - ISBN 0201-565064 
- Telecommunications Primer: Signals, Building Blocks, and Networks
  - E. Bryan Carne
  - Prentice Hall, 1995.
  - ISBN 0-13-206129-5
- Telecommunications Switching, Traffic and Networks
  - J.E. Flood
  - Prentice Hall, 1994.
  - ISBN 0-13-033309-3

* 4th year


* 3rd year

** Concurrent Systems

- Concurrent Systems: Operating Systems
  - 2nd edition
  - Jean Bacon
  - Addison Wesley
  - 1998
  - /ISBN-10: 0-201-17767-6/
  - /ISBN-13: 978-0-201-17767-1/

- Inside Windows NT
  - Second Edition
  - David A. Solomon, Helen Custer
  - Microsoft Press
  - /ISBN-10: 978-1-57231-677-5/
  - /ISBN-13: 1-57231-677-2/

- Java An Object Orientated Language
  - Michael Smith
  - McGraw-Hill
  - /ISBN-10: 0-07-709460-3/
  - /ISBN-13: 978-0-07-709460-7/

- Beginning Java
  - Ivor Horton
  - Wrox
  - /ISBN-10: 1-86100-027-8/
  - /ISBN-13: 978-1-86100-027-9/

- Java in a Nutshell
  - David Flanagan
  - O'Reilly
  - /ISBN-10: 1-56592-262-X/
  - /ISBN-13: 978-1-56592-262-4/

# - Inside Windows NT
# - Helen Custer
# - Microsoft Press
# - Microsoft Press, c1993.
# - 155615481x
# - 978-1556154812

** maths

kreysig

** Microprocessor Systems 1

- MC68000 User's Manual >= 2e
  - M68000 8-/16-/32-Bit Microprocessors User's Manual
  - 9th ed.
  - Motorola
- M68000 Programmer's Reference Manual
  - M68000 Family Programmer’s Reference Manual
  - Motorola
  - M68000PM/AD, M68000 Programmer's Reference Manual
  - 1992
- 68000: Assembly Language Programming
  - Gerry Kane, Doug Hawkins, Lance A. Leventhal
  - McGraw-Hill,
  - 1981,
  - ISBN 0-931988-62-4
- The Motorola Mc68000: An Introduction to Processor, Memory, and Interfacing
  - Jean Bacon
  - 1986
  - ISBN-10: 0136041094
  - ISBN-13: 978-0136041092
- Programming the MC68000
  - Tim King, Brian Knight
  - 2nd Edition
  - 1987
  - 0805355502
  - 9780805355505
- 68000 Family Assembly Language
  - Alan Clements
  - PWS
  - 1994
  - ISBN 0-534-93275-4

** Microprocessor Systems 2

- Microprocessor Systems Design
  - 68000 Hardware, Software and Interfacing.
  - 3rd Edition
  - Alan Clements
  - 9780534948221
  - 0534948235
  - PWS Publishing, c1998.
- Computer Architecture – A Quantitative Approach
  - John Hennessey & David Patterson
- High Performance Computer Architecture
  - 3rd Edition
  - Harold S Stone 
- Computer Architecture and Design
  - AJ Van De Goor

** Numerical Methods

- /Methods of Numerical Integration/
  - Philip J. Davis, Philip Rabinowitz

** Signals And Systems

- Signals and Systems – An Introduction
  - 2nd Edition
  - Leslie Balmer
  - Prentice Hall (1997)

** Telecommunications

- Information, Transmission, Modulation and Noise
  - Schwartz
  - McGraw Hill
- Electronic Communication Techniques
  - 3rd Edition
  - Paul H. Young
  - Merrill
- Probability for Electronic Engineering
  - Leon Garcia
  - Addison Wesley
- Analog and Digital Communication Systems
  - 3rd Edition
  - Martin S. Roden
  - Prentice-Hall
- Digital Communication Systems Design
  - Martin S. Roden
  - Prentice-Hall

* 2nd year
** Computer Programming and Problem Solving
- Object Orientated Software in C++, M Smith, Chapman Hall
- C++ How To Program, H Deitel & P Deitel, Prentice Hall

** applied maths
- Dynamics: Engineering Mechanics 
  - 4th Edition
  - J. L. Meriam, L. G. Kraige
  - ISBN-13: 978-0471597674 
- Engineering Mechanics: Dynamics
  - 2nd Edition
  - William F. Riley, Leroy D. Sturges
  - ISBN: 978-0-471-05339-2
- Classical Mechanics
  - 4th Edition
  - Tom W B Kibble, Frank H Berkshire

* 1st year
** maths
- elementary linear algebra anton 6th
- calculus thomas and finney 9th

[[./books.html][back]]
