books/college-books.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>College Books</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">College Books</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org661b86a">5th year</a>
<ul>
<li><a href="#orgf852283">Server-Side Development</a></li>
<li><a href="#org4265f0d">Digital Signal Processing</a></li>
<li><a href="#orge8a9c93">Data Networks</a></li>
</ul>
</li>
<li><a href="#org4814e70">4th year</a></li>
<li><a href="#orgabb359e">3rd year</a>
<ul>
<li><a href="#org4833c02">Concurrent Systems</a></li>
<li><a href="#orgdfdf479">maths</a></li>
<li><a href="#orgb4d2bae">Microprocessor Systems 1</a></li>
<li><a href="#orgb81b3b9">Microprocessor Systems 2</a></li>
<li><a href="#org51ff381">Numerical Methods</a></li>
<li><a href="#org79bc74c">Signals And Systems</a></li>
<li><a href="#org5d0de84">Telecommunications</a></li>
</ul>
</li>
<li><a href="#org18c48c7">2nd year</a>
<ul>
<li><a href="#orge60148a">Computer Programming and Problem Solving</a></li>
<li><a href="#org67cb1f2">applied maths</a></li>
</ul>
</li>
<li><a href="#org2b368ec">1st year</a>
<ul>
<li><a href="#org328d483">maths</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org661b86a" class="outline-2">
<h2 id="org661b86a">5th year</h2>
<div class="outline-text-2" id="text-org661b86a">
</div>
<div id="outline-container-orgf852283" class="outline-3">
<h3 id="orgf852283">Server-Side Development</h3>
</div>

<div id="outline-container-org4265f0d" class="outline-3">
<h3 id="org4265f0d">Digital Signal Processing</h3>
<div class="outline-text-3" id="text-org4265f0d">
<ol class="org-ol">
<li>Analogue And Digital Signal Processing And Coding
<ul class="org-ul">
<li>P. M. Grant &#x2026;[et al.]</li>
<li>Chartwell-Bratt</li>
<li>1989</li>
<li><i>ISBN-10: 0862382068</i></li>
<li><i>ISBN-13: 978-0862382063</i></li>
</ul></li>
<li>Advanced Topics In Signal Processing
<ul class="org-ul">
<li>Jae S. Lim and Alan V. Oppenheim</li>
<li>Prentice-Hall</li>
<li>c1988</li>
<li><i>ISBN-10: 0130129801</i></li>
<li><i>ISBN-13: 978-0130129802</i></li>
</ul></li>
<li>Digital Signal Processing : Principles, Algorithms, And Applications
<ul class="org-ul">
<li>John G. Proakis, Dimitris G. Manolakis</li>
<li>Macmillan</li>
<li>c1992</li>
<li>Notes Rev. ed. of: Introduction to digital signal processing. c1988</li>
</ul></li>
<li>Digital Signal Processing
<ul class="org-ul">
<li>Richard A. Roberts, Clifford T. Mullis</li>
<li>Addison-Wesley</li>
<li>c1987</li>
</ul></li>
<li>Schaum's Outline Of Theory And Problems Of Digital Signal Processing
<ul class="org-ul">
<li>Monson H. Hayes</li>
<li>McGraw Hill</li>
<li>1999</li>
</ul></li>
<li>Two-Dimensional Signal And Image Processing
<ul class="org-ul">
<li>Jae S. Lim</li>
<li>Prentice Hall</li>
<li>c1990</li>
</ul></li>
<li>Digital Coding Of Waveforms : Principles And Applications To Speech And Video
<ul class="org-ul">
<li>N.S. Jayant, Peter Noll</li>
<li>Prentice-Hall</li>
<li>c1984</li>
</ul></li>
<li>Digital Signal Processing : Theory, Applications, And Hardware
<ul class="org-ul">
<li>Richard A. Haddad and Thomas W. Parsons</li>
<li>Computer Science Press</li>
<li>c1991</li>
</ul></li>
<li>Fundamentals Of Digital Image Processing
<ul class="org-ul">
<li>Anil K. Jain</li>
<li>Prentice Hall</li>
<li>c1989</li>
</ul></li>
<li>Digital Processing Of Speech Signals
<ul class="org-ul">
<li>Lawrence R. Rabiner, Ronald W. Schafer</li>
<li>Prentice-Hall</li>
<li>c1978</li>
</ul></li>
<li>Speech And Audio Signal Processing : Processing And Perception Of Speech And Music
<ul class="org-ul">
<li>Ben Gold, Nelson Morgan</li>
<li>John Wiley</li>
<li>2000</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orge8a9c93" class="outline-3">
<h3 id="orge8a9c93">Data Networks</h3>
<div class="outline-text-3" id="text-orge8a9c93">
<ul class="org-ul">
<li>Computer Networks
<ul class="org-ul">
<li>4th Edition</li>
<li>Andrew Tanenbaum</li>
<li>Pearson Education, 2003.</li>
<li>ISBN 0-13-038488-7</li>
</ul></li>
<li>Data Communications and Networking
<ul class="org-ul">
<li>2nd ed.</li>
<li>Behrouz Forouzan</li>
<li>McGraw Hill, 2000.</li>
<li>ISBN 0-07-118160-1</li>
</ul></li>
<li>Data Communications, Computer Networks and Open Systems
<ul class="org-ul">
<li>4th Edition</li>
<li>Fred Halsall</li>
<li>Addison-Wesley, 1995.</li>
<li>ISBN 0201-565064</li>
</ul></li>
<li>Telecommunications Primer: Signals, Building Blocks, and Networks
<ul class="org-ul">
<li>E. Bryan Carne</li>
<li>Prentice Hall, 1995.</li>
<li>ISBN 0-13-206129-5</li>
</ul></li>
<li>Telecommunications Switching, Traffic and Networks
<ul class="org-ul">
<li>J.E. Flood</li>
<li>Prentice Hall, 1994.</li>
<li>ISBN 0-13-033309-3</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4814e70" class="outline-2">
<h2 id="org4814e70">4th year</h2>
</div>


<div id="outline-container-orgabb359e" class="outline-2">
<h2 id="orgabb359e">3rd year</h2>
<div class="outline-text-2" id="text-orgabb359e">
</div>
<div id="outline-container-org4833c02" class="outline-3">
<h3 id="org4833c02">Concurrent Systems</h3>
<div class="outline-text-3" id="text-org4833c02">
<ul class="org-ul">
<li>Concurrent Systems: Operating Systems
<ul class="org-ul">
<li>2nd edition</li>
<li>Jean Bacon</li>
<li>Addison Wesley</li>
<li>1998</li>
<li><i>ISBN-10: 0-201-17767-6</i></li>
<li><i>ISBN-13: 978-0-201-17767-1</i></li>
</ul></li>

<li>Inside Windows NT
<ul class="org-ul">
<li>Second Edition</li>
<li>David A. Solomon, Helen Custer</li>
<li>Microsoft Press</li>
<li><i>ISBN-10: 978-1-57231-677-5</i></li>
<li><i>ISBN-13: 1-57231-677-2</i></li>
</ul></li>

<li>Java An Object Orientated Language
<ul class="org-ul">
<li>Michael Smith</li>
<li>McGraw-Hill</li>
<li><i>ISBN-10: 0-07-709460-3</i></li>
<li><i>ISBN-13: 978-0-07-709460-7</i></li>
</ul></li>

<li>Beginning Java
<ul class="org-ul">
<li>Ivor Horton</li>
<li>Wrox</li>
<li><i>ISBN-10: 1-86100-027-8</i></li>
<li><i>ISBN-13: 978-1-86100-027-9</i></li>
</ul></li>

<li>Java in a Nutshell
<ul class="org-ul">
<li>David Flanagan</li>
<li>O'Reilly</li>
<li><i>ISBN-10: 1-56592-262-X</i></li>
<li><i>ISBN-13: 978-1-56592-262-4</i></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgdfdf479" class="outline-3">
<h3 id="orgdfdf479">maths</h3>
<div class="outline-text-3" id="text-orgdfdf479">
<p>
kreysig
</p>
</div>
</div>

<div id="outline-container-orgb4d2bae" class="outline-3">
<h3 id="orgb4d2bae">Microprocessor Systems 1</h3>
<div class="outline-text-3" id="text-orgb4d2bae">
<ul class="org-ul">
<li>MC68000 User's Manual &gt;= 2e
<ul class="org-ul">
<li>M68000 8-/16-/32-Bit Microprocessors User's Manual</li>
<li>9th ed.</li>
<li>Motorola</li>
</ul></li>
<li>M68000 Programmer's Reference Manual
<ul class="org-ul">
<li>M68000 Family Programmer’s Reference Manual</li>
<li>Motorola</li>
<li>M68000PM/AD, M68000 Programmer's Reference Manual</li>
<li>1992</li>
</ul></li>
<li>68000: Assembly Language Programming
<ul class="org-ul">
<li>Gerry Kane, Doug Hawkins, Lance A. Leventhal</li>
<li>McGraw-Hill,</li>
<li>1981,</li>
<li>ISBN 0-931988-62-4</li>
</ul></li>
<li>The Motorola Mc68000: An Introduction to Processor, Memory, and Interfacing
<ul class="org-ul">
<li>Jean Bacon</li>
<li>1986</li>
<li>ISBN-10: 0136041094</li>
<li>ISBN-13: 978-0136041092</li>
</ul></li>
<li>Programming the MC68000
<ul class="org-ul">
<li>Tim King, Brian Knight</li>
<li>2nd Edition</li>
<li>1987</li>
<li>0805355502</li>
<li>9780805355505</li>
</ul></li>
<li>68000 Family Assembly Language
<ul class="org-ul">
<li>Alan Clements</li>
<li>PWS</li>
<li>1994</li>
<li>ISBN 0-534-93275-4</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb81b3b9" class="outline-3">
<h3 id="orgb81b3b9">Microprocessor Systems 2</h3>
<div class="outline-text-3" id="text-orgb81b3b9">
<ul class="org-ul">
<li>Microprocessor Systems Design
<ul class="org-ul">
<li>68000 Hardware, Software and Interfacing.</li>
<li>3rd Edition</li>
<li>Alan Clements</li>
<li>9780534948221</li>
<li>0534948235</li>
<li>PWS Publishing, c1998.</li>
</ul></li>
<li>Computer Architecture – A Quantitative Approach
<ul class="org-ul">
<li>John Hennessey &amp; David Patterson</li>
</ul></li>
<li>High Performance Computer Architecture
<ul class="org-ul">
<li>3rd Edition</li>
<li>Harold S Stone</li>
</ul></li>
<li>Computer Architecture and Design
<ul class="org-ul">
<li>AJ Van De Goor</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org51ff381" class="outline-3">
<h3 id="org51ff381">Numerical Methods</h3>
<div class="outline-text-3" id="text-org51ff381">
<ul class="org-ul">
<li><i>Methods of Numerical Integration</i>
<ul class="org-ul">
<li>Philip J. Davis, Philip Rabinowitz</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org79bc74c" class="outline-3">
<h3 id="org79bc74c">Signals And Systems</h3>
<div class="outline-text-3" id="text-org79bc74c">
<ul class="org-ul">
<li>Signals and Systems – An Introduction
<ul class="org-ul">
<li>2nd Edition</li>
<li>Leslie Balmer</li>
<li>Prentice Hall (1997)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org5d0de84" class="outline-3">
<h3 id="org5d0de84">Telecommunications</h3>
<div class="outline-text-3" id="text-org5d0de84">
<ul class="org-ul">
<li>Information, Transmission, Modulation and Noise
<ul class="org-ul">
<li>Schwartz</li>
<li>McGraw Hill</li>
</ul></li>
<li>Electronic Communication Techniques
<ul class="org-ul">
<li>3rd Edition</li>
<li>Paul H. Young</li>
<li>Merrill</li>
</ul></li>
<li>Probability for Electronic Engineering
<ul class="org-ul">
<li>Leon Garcia</li>
<li>Addison Wesley</li>
</ul></li>
<li>Analog and Digital Communication Systems
<ul class="org-ul">
<li>3rd Edition</li>
<li>Martin S. Roden</li>
<li>Prentice-Hall</li>
</ul></li>
<li>Digital Communication Systems Design
<ul class="org-ul">
<li>Martin S. Roden</li>
<li>Prentice-Hall</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org18c48c7" class="outline-2">
<h2 id="org18c48c7">2nd year</h2>
<div class="outline-text-2" id="text-org18c48c7">
</div>
<div id="outline-container-orge60148a" class="outline-3">
<h3 id="orge60148a">Computer Programming and Problem Solving</h3>
<div class="outline-text-3" id="text-orge60148a">
<ul class="org-ul">
<li>Object Orientated Software in C++, M Smith, Chapman Hall</li>
<li>C++ How To Program, H Deitel &amp; P Deitel, Prentice Hall</li>
</ul>
</div>
</div>

<div id="outline-container-org67cb1f2" class="outline-3">
<h3 id="org67cb1f2">applied maths</h3>
<div class="outline-text-3" id="text-org67cb1f2">
<ul class="org-ul">
<li>Dynamics: Engineering Mechanics 
<ul class="org-ul">
<li>4th Edition</li>
<li>J. L. Meriam, L. G. Kraige</li>
<li>ISBN-13: 978-0471597674</li>
</ul></li>
<li>Engineering Mechanics: Dynamics
<ul class="org-ul">
<li>2nd Edition</li>
<li>William F. Riley, Leroy D. Sturges</li>
<li>ISBN: 978-0-471-05339-2</li>
</ul></li>
<li>Classical Mechanics
<ul class="org-ul">
<li>4th Edition</li>
<li>Tom W B Kibble, Frank H Berkshire</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2b368ec" class="outline-2">
<h2 id="org2b368ec">1st year</h2>
<div class="outline-text-2" id="text-org2b368ec">
</div>
<div id="outline-container-org328d483" class="outline-3">
<h3 id="org328d483">maths</h3>
<div class="outline-text-3" id="text-org328d483">
<ul class="org-ul">
<li>elementary linear algebra anton 6th</li>
<li>calculus thomas and finney 9th</li>
</ul>

<p>
<a href="./books.html">back</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
